Sequence:

// Sometimes there is a space between a number and %

2> dig[percent=+] @= dig, meas[percentsymb].

// 3 / 17 - 11 / 17 / 2011

2> dig[date=+] @= ?[month], ?[lemme:\/], ?[day], ?[lemme:-], ?[month], ?[lemme:\/], ?[day], ?[lemme:\/], ?[year].

//0.143% -0.222 %

2> dig[percent=+,dec=+] @= ?[percent,dec], ?[guess,card], ?[meas].

//from 2004 until December 2010

2> noun[time=+,period=+] @= ?[lemme:from], (?[month]), ?[year], ?[lemme:until], (?[month]), ?[year].

// references (.)

2> dig[reference=+]  @= ?[paren], dig[forref], ?[paren].
2> ?[let,reference=+]  @= ?[paren], ?[let,forref], ?[paren].
2> noun[let,reference=+]  @= ?[paren], ?[indef=~,forref], ?[paren].
